                            
 console.log("Hello World");          /*Здесь console.log используется для вывода информации в консоль браузера*/
 console.warn('Warning');             /* console.warn используется как оповещение что что-то пошло не так, но код продолжает работать; Также это информирование об устаревшеи коде*/
 console.error('It is a warning about the mistake');    /* console.error используется для быстрого поиска сбоев, сигнализирует о критических неожиданных проблемах требующих внимания */
 alert('Hello, World!');          /*Alert используется чтобы уведомить пользователя о событии или состоянии*/
 console.log('I did that')          /* В консоли показывается сначала то, что в файле js, а потом то что в html */
 
    